[
  {
   "id": 1,
   "category": "Ноутбуки",
   "name": "Ноутбук ASUS Laptop X515KA",
   "price": 12917,
   "image": [
    "https://content.rozetka.com.ua/goods/images/big/270557443.jpg",
    "https://content.rozetka.com.ua/goods/images/big/270557452.jpg",
    "https://content2.rozetka.com.ua/goods/images/big/270557462.jpg"
   ],
   "description": " ASUS Laptop 15 X515 - це універсальний ноутбук початкового рівня, що поєднує стильний дизайн і сучасні технології.\nСучасні компоненти Ноутбук ASUS Laptop 15 X515 оснащується процесором Intel, що дозволяє йому з успіхом справлятися з різними завданнями.\nПовнорозмірна клавіатура ноутбука ASUS Laptop 15 X515 відрізняється продуманою ергономікою, міцною конструкцією та оптимальною глибиною ходу клавіш – 1.4 мм .\nНоутбук ASUS Laptop 15 X515 виконаний у компактному корпусі вагою всього 1.8 кг, що робить цю модель ідеальним вибором для мобільних користувачів.\nДля швидкого обміну даними з периферійними пристроями ASUS Laptop 15 X515 пропонує високошвидкісний інтерфейс USB 3.2, виконаний у вигляді зручного оборотного гнізда Type-C. Його пропускна здатність у 10 разів перевищує можливості USB 2.0. Також є роз'єми USB 3.2 Type-A, порти USB 2.0 та відеовихід HDMI, який слугує для підключення зовнішніх моніторів або проекторів."
  },
  {
   "id": 2,
   "category": "Ноутбуки",
   "name": "Ноутбук ASUS TUF Gaming F15 FX506HE-HN012",
   "price": 40999,
   "image": [
    "https://content2.rozetka.com.ua/goods/images/big/283529272.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/283529275.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/283529281.jpg"
   ],
   "description": " Потужний арсенал для будь-яких завдань\nСучасна конфігурація робить TUF Gaming F15 універсальним пристроєм, який готовий забезпечити відмінну швидкість у широкому спектрі додатків, будь то ігри, стрімінг чи щось інше.\nДля активного життя\nКорпус TUF Gaming F15 став компактнішим і легшим, ніж y попередніх моделей серії, проте в нього вбудований акумулятор більшої місткості – 48 Вт*год. Це забезпечує тривалий час автономної роботи. Невелика вага і місткий акумулятор роблять цей ноутбук справді мобільним пристроєм.\nАрмійський стандарт надійності\nЯк і всі ноутбуки серії TUF Gaming, модель F15 відрізняється максимальною надійністю та стабільністю роботи. Вона пройшла суворі тести якості, у тому числі за американським військово-промисловим стандартом MIL-STD-810H. Такий пристрій легко витримає всі недоліки не дуже дбайливого повсякденного користування. "
  },
  {
   "id": 3,
   "category": "Ноутбуки",
   "name": "Ноутбук ASUS TUF Gaming F15 FX506LH-HN236",
   "price": 34999,
   "image": [
    "https://content1.rozetka.com.ua/goods/images/big/285886586.jpg",
    "https://content.rozetka.com.ua/goods/images/big/285886587.jpg",
    "https://content2.rozetka.com.ua/goods/images/big/285886588.jpg"
   ],
   "description": " Гра почалася\nЗавжди готовий до дії, TUF Gaming F15 легко перемикається між іграми, потоковою передачею та багато іншим. Процесор Intel Core забезпечує повсякденну роботу та розваги. Графіка відрізняється високою швидкістю та плавністю завдяки передовому графічному процесору GeForce, який надійно забезпечує високу частоту кадрів.\nДля активного життя\nКорпус TUF Gaming F15 став компактнішим і легким, ніж у попередніх моделей серії, проте в нього вбудований акумулятор більшої місткості – 48 Вт*ч. Це забезпечує тривалий час автономної роботи. Невелика вага і місткий акумулятор роблять цей ноутбук справді мобільним пристроєм.\nПобачити більше\nНоутбук TUF Gaming F15 оснащується IPS-екраном з частотою оновлення 144 Гц, який відмінно підходить для динамічних комп'ютерних ігор.  "
  },
  {
   "id": 4,
   "category": "Ноутбуки",
   "name": "Ноутбук LENOVO IdeaPad 3 17ALC6",
   "price": 26900,
   "image": [
    "https://content.rozetka.com.ua/goods/images/big/281442845.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/281442854.jpg",
    "https://content2.rozetka.com.ua/goods/images/big/281442861.jpg"
   ],
   "description": " БІЛЬШЕ МОЖЛИВОСТЕЙ ЗА ДОСТУПНОЮ ЦІНОЮ\nНоутбуки IdeaPad 3 ламають стереотипи про те, на що здатні пристрої для повсякденного використання. Передові процесори Intel і опціональні дискретні відеокарти дозволять вам розкрити потенціал своїх систем і отримати в своє розпорядження широкі мультимедійні можливості.\nПЕРЕВЕРШУЮЧИ ОЧІКУВАННЯ\nТонкі рамки, що обрамляють дисплей IdeaPad 3 з двох сторін, надають цьому ноутбуку витончений вид і забезпечують зручність перегляду для користувача. Незалежно від того, чи дивитеся ви відео, слухаєте музику або спілкуєтеся з друзями в чаті, технологія Dolby Audio ™ забезпечить кришталеву чіткість звучання.\nФУНКЦІЇ БЕЗПЕКИ У ВАС ПІД РУКОЮ\nНоутбук IdeaPad 3 оснащений веб-камерою для зручності спілкування з друзями і близькими. Але що з нею робити, коли вона не використовується? Просто закрийте веб-камеру захисною шторкою і створіть бар'єр, який надійно захистить вас від потенційних зловмисників.  "
  },
  {
   "id": 5,
   "category": "Монітори",
   "name": "Монітор 24.5' Asus TUF Gaming VG259QR",
   "price": 9399,
   "image": [
    "https://content.rozetka.com.ua/goods/images/big/168721089.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/168721090.jpg",
    "https://content.rozetka.com.ua/goods/images/big/168721091.jpg"
   ],
   "description": " Діагональ дисплея 24.5\nМаксимальна роздільна здатність дисплея 1920x1080 (FullHD)\nЧас реакції матриці 1 мс MPRT\nЯскравість дисплея 300 кд/м²\nТип матриці IPS"
  },
  {
   "id": 6,
   "category": "Монітори",
   "name": "Монітор 23.8' AOC 24G2SAE/BK - 165 Hz",
   "price": 6999,
   "image": [
    "https://content.rozetka.com.ua/goods/images/big/300747657.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/168721090.jpg",
    "https://content.rozetka.com.ua/goods/images/big/168721091.jpg"
   ],
   "description": " Діагональ дисплея 23.8'\n Максимальна роздільна здатність дисплея 1920x1080 (FullHD)\n Час реакції матриці 1 ms (MPRT), 4 ms (GTG)\n Яскравість дисплея 350 кд/м²\n Тип матриці VA\n Контрастність дисплея 1000:1"
  },
  {
   "id": 7,
   "category": "Монітори",
   "name": "Монітор 23.8' BenQ GW2480L",
   "price": 5299,
   "image": [
    "https://content1.rozetka.com.ua/goods/images/big/294714182.jpg",
    "https://content2.rozetka.com.ua/goods/images/big/290800701.jpg",
    "https://content.rozetka.com.ua/goods/images/big/290800710.jpg"
   ],
   "description": "  Діагональ дисплея 23.8'\n Максимальна роздільна здатність дисплея 1920x1080 (FullHD)\n Час реакції матриці 5 ms\n Яскравість дисплея 250 кд/м²\n Тип матриці IPS\n Контрастність дисплея 1000:1"
  },
  {
   "id": 8,
   "category": "Планшети",
   "name": "Планшет Samsung Galaxy Tab S6 Lite Wi-Fi 64GB Blue",
   "price": 13799,
   "image": [
    "https://content.rozetka.com.ua/goods/images/big/23710431.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/23710415.jpg",
    "https://content.rozetka.com.ua/goods/images/big/23710355.jpg"
   ],
   "description": "Galaxy Tab S6 Lite — ваш суперпортативний і ефективний супутник для нотаток. Він обладнаний 10.4-дюймовим дисплеєм у тонкому та легкому корпусі, має інтерфейс One UI 2 на основі Android, укомплектований пером S Pen і готовий до роботи. Малювання, навчання, ігри — планшет просто створений, щоб бути під рукою."
  },
  {
   "id": 9,
   "category": "Планшети",
   "name": "Планшет Lenovo Tab P11 Plus 4G 128 GB Slate Grey",
   "price": 15999,
   "image": [
    "https://content1.rozetka.com.ua/goods/images/big/228634535.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/228634536.jpg",
    "https://content1.rozetka.com.ua/goods/images/big/228634544.jpg"
   ],
   "description": "Якісна картинка під будь-яким кутом\n Нехай ніщо не відвертає увагу від перегляду. Планшет з 11-дюймовим дисплеєм із роздільною здатністю 2000 x 1200 прекрасно підходить для перегляду улюблених шоу та відео із сервісів Netflix і YouTube. Завдяки технології IPS світлини й відеоролики залишаються чіткими та яскравими під будь-яким кутом. Висока якість картинки гарантована, навіть якщо за планшетом збереться вся родина.\nЗвук, який тече навколо вас\nНасолоджуйтесь насиченими та потужними звуками, що йдуть з усіх боків — навіть над головою — завдяки технології Dolby Atmos. Чи слухаєте ви через навушники, чи через фронтальні колонки, звук оточуватиме та занурюватиме вас."
  },
  {
    "id": 10,
    "category": "Ноутбуки",
    "name": "Ноутбук Apple MacBook Air 13' M1 256GB 2020",
    "price": 42999,
    "image": [
     "https://content1.rozetka.com.ua/goods/images/big/144249716.jpg",
     "https://content1.rozetka.com.ua/goods/images/big/144249735.jpg",
     "https://content1.rozetka.com.ua/goods/images/big/144249835.jpg"
    ],
    "description": " Найтонший і найлегший ноутбук від Apple стає надпотужним завдяки чипу Apple M1\nЛегко виконуйте будь-які завдання завдяки надшвидкісному 8-ядерному центральному процесору. Графічний процесор із щонайбільше 8 ядрами забезпечує відмінне зображення в додатках та іграх зі складною графікою. 16-ядерна система Neural Engine прискорює виконання всіх операцій, у яких використовується машинне навчання. Конструкція без вентилятора гарантує безшумну роботу. А ще новий MacBook Air побив власний рекорд роботи від акумулятора — тепер він працює без підзарядки до 18 годин. Досі ідеально портативний. А тепер ще й набагато потужніший."
   }
 
 ]