import { PayloadAction, createSlice } from "@reduxjs/toolkit";
import { TPost } from "../types";

const postsSlice = createSlice({
  name: "reviews",
  initialState: {
    posts: [
      {
        _id: "1",
        name: "Як обрати ідеальний смартфон?",
        image: "",
        description:
          "Дізнайтеся, як правильно обрати ідеальний смартфон для своїх потреб! Наші експерти розкажуть про ключові характеристики, які слід враховувати при виборі смартфона, а також про найновітніші технології та тренди в світі мобільних пристроїв.",
          content: `
       # Як обрати ідеальний смартфон: практичні поради від "Сокет" Дізнайтеся, як правильно обрати ідеальний смартфон для своїх потреб! У нашому інтернет-магазині "Сокет" ми зрозуміли, що ринок мобільних пристроїв постійно змінюється, тому ми готові допомогти вам зробити правильний вибір.
       
       ## Ключові характеристики смартфона
       
       При обиранні смартфона слід звернути увагу на такі ключові характеристики:
       
       1. **Процесор та оперативна пам'ять:** Потужний процесор та достатня оперативна пам'ять забезпечать плавну та швидку роботу смартфона.
       
       2. **Дисплей:** Висока роздільна здатність, яскравість та колірна гамма дозволять насолоджуватися візуальним контентом на повну.
       
       3. **Камери:** Якісна камера дозволить знімати вражаючі фотографії та відео.
       
       4. **Батарея:** Містка батарея забезпечить довгий час автономної роботи смартфона.
       
       5. **Операційна система:** Виберіть смартфон з актуальною версією операційної системи, щоб мати доступ до всіх оновлень та функцій.
       
       ## Найновітніші технології та тренди
       
       У світі мобільних пристроїв неухильно розвиваються нові технології та тренди. Ознайомтесь з деякими з них:
       
       1. **5G-підтримка:** Технологія 5G дозволяє отримати неймовірно швидкий інтернет і прискорені зв'язки.
       
       2. **AI та машинне навчання:** Смартфони з підтримкою штучного інтелекту допомагають забезпечити оптимізовану роботу та підвищити продуктивність.
       
       3. **Бездоганний дизайн:** Сучасні смартфони мають елегантний дизайн із тонкими рамками та великими екранами.
       
       4. **Розумна фотографія:** Камери з підтримкою розумних функцій та алгоритмів дозволяють отримувати найкращі фотографії в будь-яких умовах.
       
       ## Звертайтесь до наших експертів
       
       Якщо ви маєте сумніви щодо вибору смартфона або бажаєте отримати консультацію, наші експерти завжди раді допомогти вам. Відвідайте наш інтернет-магазин або зв'яжіться з нами за контактними телефонами.
       
       Не втрачайте можливості насолоджуватися передовими технологіями та обирайте ідеальний смартфон від "Сокет" прямо зараз!
       `
        },
      {
        _id: "2",
        name: "Топові технології для сучасного дому",
        image: "",
        description:
          'Поглибіться у світ майбутнього та дізнайтеся про найсучасніші технології для дому, які пропонує "Сокет". Від смарт-пристроїв для управління будинком до екосистем "розумного будинку", знайте, як зробити своє життя більш комфортним та ефективним.',
          content:`
          # Топові технології для сучасного дому: інновації від "Сокет"
          
          Сучасний дім – це не просто місце для проживання, це справжнє простір для інновацій та технологічного розвитку. У "Сокет" ми прагнемо пропонувати найкращі технології для вашого дому, які роблять життя комфортнішим, ефективнішим та безпечнішим.
          
          ## Розумний дім та інтернет речей (IoT)
          
          Розумні пристрої та системи IoT дозволяють забезпечити повний контроль над вашим домом з будь-якого місця. Віддалене керування освітленням, опаленням, системами безпеки та багато іншого – все це стає реальністю з нашими рішеннями.
          
          ## Системи "розумний будинок"
          
          Ми пропонуємо інтегровані системи "розумний будинок", які забезпечують автоматизацію та оптимізацію багатьох процесів. Від простого керування світлом до складних рішень зі звуком, відео та безпекою – все це допомагає зробити ваш дім ще більш комфортним.
          
          ## Смарт-пристрої для дому
          
          Знаєте, що ваш холодильник може складати список покупок, а пральна машина запускатися за допомогою смартфона? У нашому асортименті ви знайдете найновітніші смарт-пристрої для будинку, які спростять ваше життя та зекономлять час.
          
          ## Безпека та захист
          
          Ми приділяємо особливу увагу безпеці вашого дому. Системи відеоспостереження, сигналізації та контролю доступу – все це допомагає створити надійний захист для вас та вашої родини.
          
          ## Енергоефективні рішення
          
          Збереження енергії – це не тільки корисно для навколишнього середовища, але й для вашого гаманця. Ми пропонуємо енергоефективні рішення, які дозволять економити електроенергію та знизити витрати.
          
          ## Звертайтесь до наших експертів
          
          Наші експерти завжди готові допомогти вам обрати найкращі технології для вашого сучасного дому. Відвідайте наш інтернет-магазин або зв'яжіться з нами за контактними телефонами.
          
          Зробіть ваш дім ще сучаснішим та зручнішим з інноваційними технологіями від "Сокет"!
          `
        },
      {
        _id: "3",
        name: 'Електроніка для молоді: знайди свій стиль у "Сокет"',
        image: "",
        description:
          "Ми розуміємо, наскільки важливою є електроніка для сучасних молодих людей. У нашій статті ми розкажемо про найкрутіші гаджети та стильні аксесуари, які допоможуть виразити вашу індивідуальність та підкреслити ваш стиль.",
          content: `
          # Електроніка для молоді: знайди свій стиль у "Сокет"
          
          "Сокет" пропонує молоді та енергійній аудиторії широкий вибір електроніки та гаджетів, що допоможуть виразити вашу індивідуальність та підкреслити ваш стиль. Ознайомтесь з нашим асортиментом та знайдіть ідеальний продукт, що відповідає вашим потребам та бажанням.
          
          ## Смартфони зі стильним дизайном
          
          Смартфон – це не тільки потужний пристрій, а й важлива частина вашого образу. У нашому магазині ви знайдете смартфони зі стильним та сучасним дизайном, що додадуть вашому образу неповторного шарму.
          
          ## Навушники та акустичні системи
          
          Музика – це складова частина життя молоді. У нас ви зможете придбати навушники та акустичні системи, які забезпечать вам найкращий звук і дозволять насолоджуватися улюбленою музикою.
          
          ## Гаджети для активного відпочинку
          
          Активний відпочинок – це стиль життя багатьох молодих людей. У нашому асортименті ви знайдете гаджети для спорту, подорожей та активних розваг, які стануть вашими незамінними помічниками.
          
          ## Модні аксесуари
          
          Деталі роблять ваш образ особливим. У "Сокет" ви зможете придбати модні та стильні аксесуари для телефонів та гаджетів, що додадуть вашому образу індивідуальності.
          
          ## Зручні покупки та доставка
          
          Ми робимо покупки зручними та приємними. Замовляйте електроніку онлайн на нашому сайті і ми доставимо її прямо до вашої дверей. Ви зможете насолоджуватися вашим новим гаджетом без зайвих клопотів.
          
          ## Звертайтесь до нас
          
          Наші експерти завжди готові допомогти вам обрати найкращу електроніку, що відповідає вашому стилю та бажанням. Відвідайте наш інтернет-магазин або зв'яжіться з нами за контактними телефонами.
          
          Оберіть стильну та сучасну електроніку для молоді від "Сокет" та виразіть себе на повну!
          `
        },
      {
        _id: "4",
        name: "Гаджети для активного відпочинку",
        image: "",
        description:
          'Чи любите ви активний відпочинок та пригоди? В нашій статті ми представимо найкращі гаджети для подорожей, спорту та відпочинку на природі. За допомогою "Сокет" ви зможете зберегти світлини епічних моментів та зробити ваші пригоди ще цікавішими та захопливішими!',
        content: `
        # Гаджети для активного відпочинку: відкрийте світ розваг з "Сокет"
        
        У "Сокет" ми розуміємо, наскільки важливий активний відпочинок та пригоди. Тому ми пропонуємо широкий вибір гаджетів для подорожей, спорту та відпочинку на природі. З нами ви зможете зберегти світлини епічних моментів та зробити ваші пригоди ще цікавішими та захопливішими!
        
        ## Екшн-камери та камери 360°
        
        Фіксуйте кожен момент своїх пригод з допомогою екшн-камер та камер 360°. Ви зможете зняти захоплюючі відео та фотографії в будь-яких умовах і ділитися ними з друзями.
        
        ## Дрони для пташиного польоту
        
        Огляньте світ з висоти пташиного польоту за допомогою дронів. Вони дозволяють знімати чудові панорами та вражаючі види, а також допомагають відкрити нові місця для пригод.
        
        ## Смарт-годинники для спорту
        
        Спорт – це стиль життя. Смарт-годинники для спорту допоможуть вам відстежувати ваші тренування, серцевий ритм та покращити результати.
        
        ## Портативні акустичні системи
        
        Музика завжди супроводжує наші пригоди. Портативні акустичні системи допоможуть створити атмосферу та насолодитися улюбленою музикою в будь-якому місці.
        
        ## Гаджети для екстремальних видів спорту
        
        Для любителів екстремальних відчуттів ми пропонуємо гаджети, що допоможуть зняти вражаючі відео під час кайтсерфінгу, скейтбордингу, лижних та сноубордичних трюків.
        
        ## Зручні покупки та доставка
        
        Ми робимо покупки зручними та приємними. Замовляйте гаджети для активного відпочинку онлайн на нашому сайті і ми доставимо їх прямо до вашої дверей. Ви зможете вирушити на нові пригоди без зайвих клопотів.
        
        ## Звертайтесь до нас
        
        Наші експерти завжди готові допомогти вам обрати найкращі гаджети для активного відпочинку, які доповнять ваші пригоди та зроблять їх ще яскравішими. Відвідайте наш інтернет-магазин або зв'яжіться з нами за контактними телефонами.
        
        Відкрийте для себе світ розваг та активного відпочинку з гаджетами від "Сокет"!
        `,
      },
    ] as TPost[],
    currentPost: {} as TPost,
  },

  reducers: {
    setCurrentPost(state, action: PayloadAction<TPost>) {
      state.currentPost = action.payload;
    },
  },
});

export const { setCurrentPost } = postsSlice.actions;
export default postsSlice.reducer;
